# Taps
tap "homebrew/cask"
tap "homebrew/services"
tap "teamookla/speedtest"

brew "apache-arrow"
brew "asdf"
brew "coreutils"
brew "cmake"
brew "direnv"
brew "docker-compose"
brew "duti"
brew "fzf"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "mas"
brew "mysql"
brew "neofetch"
brew "openssl@1.1"
brew "postgresql@14"
brew "readline"
brew "redis"
brew "ruby-build"
brew "shared-mime-info"
brew "speedtest"
brew "tmux"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "z"
brew "zstd"

# Casks
cask "aerial"
cask "android-studio"
cask "bartender"
cask "cyberduck"
cask "daisydisk"
cask "docker"
cask "dropshare"
cask "element"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "miniconda"
cask "miro"
cask "notion"
cask "numi"
cask "obsidian"
cask "optimage"
cask "postgres-unofficial"
cask "postico"
cask "protonvpn"
cask "rapidapi"
cask "raycast"
cask "redisinsight"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "tailscale"
cask "vlc"

# MacOS App Store
mas "1Blocker", id: 1365531024
mas "BetterJSON", id: 1511935951
mas "Bumpr", id: 1166066070
mas "Dark Reader for Safari", id: 1438243180
mas "Eat the Shorts", id: 1668012393
mas "Notion Web Clipper", id: 1559269364
mas "PingDoctor", id: 1350044974
mas "Pixelmator Pro", id: 1289583905
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "Structured - Planner & Agenda", id: 1499198946
mas "WiFi Explorer", id: 494803304
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
