# Taps
tap "homebrew/cask"
tap "homebrew/services"
tap "teamookla/speedtest"

brew "apache-arrow"
brew "asdf"
brew "coreutils"
brew "cmake"
brew "direnv"
brew "docker-compose"
brew "duti"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mysql"
brew "neofetch"
brew "openssl@1.1"
brew "postgresql@14"
brew "readline"
brew "redis"
brew "ruby-build"
brew "shared-mime-info"
brew "speedtest"
brew "wget"
brew "yt-dlp"
brew "z"
brew "zstd"

# Casks
cask "1password"
cask "android-studio"
cask "bartender"
cask "daisydisk"
cask "dash"
cask "docker"
cask "dropshare"
cask "element"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "linear-linear"
cask "miniconda"
cask "notion"
cask "obsidian"
cask "optimage"
cask "paw"
cask "postgres-unofficial"
cask "postico"
cask "protonvpn"
cask "raycast"
cask "sketch"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "tableplus"
cask "tailscale"
cask "transmit"
cask "vlc"

# MacOS App Store
mas "1Blocker", id: 1365531024
mas "BetterJSON for Safari", id: 1511935951
mas "Bumpr", id: 1166066070
mas "Dark Reader for Safari", id: 1438243180
mas "MeetingBar", id: 1532419400
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "Speedtest", id: 1153157709
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
