# Taps
tap "homebrew/services"
tap "teamookla/speedtest"

brew "asdf"
brew "coreutils"
brew "cmake"
brew "direnv"
brew "docker-compose"
brew "duti"
brew "fastfetch"
brew "fzf"
brew "htop"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "mas"
brew "readline"
brew "redis"
brew "speedtest"
brew "tmux"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "z"

# Casks
cask "alt-tab"
cask "anytype"
cask "android-studio"
cask "bartender"
cask "betterdisplay"
cask "clop"
cask "cyberduck"
cask "docker"
cask "dropshare"
cask "figma"
cask "font-source-code-pro"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "miniconda"
cask "notion"
cask "numi"
cask "postgres-unofficial"
cask "postico"
cask "protonvpn"
cask "rapidapi"
cask "raycast"
cask "redisinsight"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "vlc"
cask "zed"

# MacOS App Store
mas "1Blocker", id: 1365531024
mas "BetterJSON", id: 1511935951
mas "Bitwarden", id: 1352778147
mas "Bumpr", id: 1166066070
mas "Dark Reader for Safari", id: 1438243180
mas "Eat the Shorts", id: 1668012393
mas "Keka", id: 470158793
mas "Microsoft Remote Desktop", id: 1295203466
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "StopTheMadness Pro", id: 6471380298
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
